MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX128ZVMD10/mcu.h
#define TRAMPO                        0x00000010      // For devices with FlexNVM: Traditional RAM Power Option
#define VLPRS                         0x00000008      // Very Low Power Run Status
#define REGONS                        0x00000004      // Regulator in Run Regulation Status


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE1 register.
//
//*****************************************************************************

#define WUPE3                         0x00000180      // Wakeup Pin Enable for LLWU_P3
#define WUPE2                         0x00000060      // Wakeup Pin Enable for LLWU_P2
#define WUPE1                         0x00000018      // Wakeup Pin Enable for LLWU_P1
#define WUPE0                         0x00000006      // Wakeup Pin Enable for LLWU_P0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE2 register.
//
//*****************************************************************************

#define WUPE7                         0x00000180      // Wakeup Pin Enable for LLWU_P7
#define WUPE6                         0x00000060      // Wakeup Pin Enable for LLWU_P6
#define WUPE5                         0x00000018      // Wakeup Pin Enable for LLWU_P5
#define WUPE4                         0x00000006      // Wakeup Pin Enable for LLWU_P4


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE3 register.
//
//*****************************************************************************

#define WUPE11                        0x00000180      // Wakeup Pin Enable for LLWU_P11
#define WUPE10                        0x00000060      // Wakeup Pin Enable for LLWU_P10
#define WUPE9                         0x00000018      // Wakeup Pin Enable for LLWU_P9
#define WUPE8                         0x00000006      // Wakeup Pin Enable for LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE4 register.
//
//*****************************************************************************

#define WUPE15                        0x00000180      // Wakeup Pin Enable for LLWU_P15
#define WUPE14                        0x00000060      // Wakeup Pin Enable for LLWU_P14
#define WUPE13                        0x00000018      // Wakeup Pin Enable for LLWU_P13
#define WUPE12                        0x00000006      // Wakeup Pin Enable for LLWU_P12


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_ME register.
//
//*****************************************************************************

#define WUME7                         0x00000080      // Wakeup Module Enable for Module 7
#define WUME6                         0x00000040      // Wakeup Module Enable for Module 6
#define WUME5                         0x00000020      // Wakeup Module Enable for Module 5
#define WUME4                         0x00000010      // Wakeup Module Enable for Module 4
#define WUME3                         0x00000008      // Wakeup Module Enable for Module 3
#define WUME2                         0x00000004      // Wakeup Module Enable for Module 2
#define WUME1                         0x00000002      // Wakeup Module Enable for Module 1
#define WUME0                         0x00000001      // Wakeup Module Enable for Module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F1 register.
//
//*****************************************************************************

#define WUF7                          0x00000080      // Wakeup Flag for LLWU_P7
#define WUF6                          0x00000040      // Wakeup Flag for LLWU_P6
#define WUF5                          0x00000020      // Wakeup Flag for LLWU_P5
#define WUF4                          0x00000010      // Wakeup Flag for LLWU_P4
#define WUF3                          0x00000008      // Wakeup Flag for LLWU_P3
#define WUF2                          0x00000004      // Wakeup Flag for LLWU_P2
#define WUF1                          0x00000002      // Wakeup Flag for LLWU_P1
#define WUF0                          0x00000001      // Wakeup Flag for LLWU_P0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F2 register.
//
//*****************************************************************************

#define WUF15                         0x00000080      // Wakeup Flag for LLWU_P15
#define WUF14                         0x00000040      // Wakeup Flag for LLWU_P14
#define WUF13                         0x00000020      // Wakeup Flag for LLWU_P13
#define WUF12                         0x00000010      // Wakeup Flag for LLWU_P12
#define WUF11                         0x00000008      // Wakeup Flag for LLWU_P11
#define WUF10                         0x00000004      // Wakeup Flag for LLWU_P10
#define WUF9                          0x00000002      // Wakeup Flag for LLWU_P9
#define WUF8                          0x00000001      // Wakeup Flag for LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F3 register.
//
//*****************************************************************************

#define MWUF7                         0x00000080      // Wakeup flag for module 7 (Error Detect)
#define MWUF6                         0x00000040      // Wakeup flag for module 6
#define MWUF5                         0x00000020      // Wakeup flag for module 5
#define MWUF4                         0x00000010      // Wakeup flag for module 4
#define MWUF3                         0x00000008      // Wakeup flag for module 3
#define MWUF2                         0x00000004      // Wakeup flag for module 2
#define MWUF1                         0x00000002      // Wakeup flag for module 1
#define MWUF0                         0x00000001      // Wakeup flag for module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_CS register.
//
//*****************************************************************************

